import React, { Component } from "react";
import { Link } from 'react-router-dom';

 
export default class Subject extends Component {
  
  
  render() {
    return (
      <div>
        <h2>বাস্তব সংখ্যা</h2>
        <p>পরিমাণকে প্রতীক তথা সংখ্যা আকারে প্রকাশ করার পদ্ধতি থেকেই গণিতের উৎপত্তি। সংখ্যার ইতিহাস মানব সভ্যতার ইতিহাসের মতই প্রাচীন। গ্রিক দার্শনিক এরিস্টটলের মতে, প্রাচীন মিশরের পুরোহিত সম্প্রদায়ের গণিত অনুশীলনের মাধ্যমে গণিতের আনুষ্ঠানিক অভিষেক ঘটে। তাই সংখ্যাভিত্তিক গণিতের সৃষ্টি যীশুখ্রিস্টের জন্মের প্রায় দুই হাজার বছর পূর্বে। এরপর নানা জাতি ও সভ্যতার হাত ঘুরে অধুনা সংখ্যা ও সংখ্যারীতি একটি সার্বজনীন রূপ ধারণ করেছে।</p>
        <img src="http://notunboi.com/images/4/43/9-10_gonit._L.1.1.jpg" alt="bastob songkha"/>
        <p>স্বাভাবিক সংখ্যা গণনার প্রয়োজনে প্রাচীন ভারতবর্ষের গণিতবিদগণ সর্বপ্রথম শূন্ন্য ও দশভিত্তিক স্থানীয়মান পদ্ধতির প্রচলন করেন, যা সংখ্যা বর্ণনায় একটি মাইলফলক হিসাবে বিবেচিত। ভারতীয় ও চীনা গণিতবিদগণ শূন্ন্য, ঋণাত্মক, বাস্তব, পূর্ণ ও ভগ্নাংশের ধারণার বিস্তৃতি ঘটান যা মধ্যযুগে আরবীয় গণিতবিদরা ভিত্তি হিসেবে গ্রহণ করেন। দশমিক ভগ্নাংশের সাহায্যে সংখ্যা প্রকাশের কৃতিত্ব মধ্যপ্রাচ্যের মুসলিম গণিতবিদদের বলে মনে করা হয়। আবার তাঁরাই একাদশ শতাব্দীতে সর্বপ্রথম বীজগাণিতীয় দ্বিঘাত সমীকরণের সমাধান হিসেবে বর্গমূল আকারে অমূলদ সংখ্যার প্রবর্তন করেন। ইতিহাসবিদদের ধারণা খ্রিস্টপূর্ব ৫০ অব্দের কাছাকাছি গ্রিক দার্শনিকরাও জ্যামিতিক অঙ্কনের প্রয়োজনে অমূলদ সংখ্যা, বিশেষ করে দুই-এর বর্গমূলের প্রয়োজনীয়তা অনুভব করেছিলেন। ঊনবিংশ শতাব্দীতে ইউরোপীয় গণিতবিদরা বাস্তব সংখ্যার প্রণালীবদ্ধ করে পূর্ণতা দান করেন। দৈনন্দিন প্রয়োজনে বাস্তব সংখ্যা সম্বন্ধে শিক্ষার্থীদের সুস্পষ্ট জ্ঞান থাকা প্রয়োজন। </p>
        <div className="container">
        <h1>Home Page</h1>
        <p>
        <Link to="/taniarascia">User</Link> on GitHub.
        </p>
    </div>


      </div>

    );
  }
}